
# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, CBAM, [256]]        # 5
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 6, C2f, [512, True]]   # 7
  - [-1, 1, CBAM, [512]]        # 8 
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 3, C2f, [1024, True]]  # 10
  - [-1, 1, SPPF, [1024, 5]]    # 11

neck:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]      
  - [[-1, 7], 1, Concat, [1]]                       # Concatenate with the P4 layer (index 7) of the backbone
  - [-1, 3, C2f, [512]]                             # Use C2f, output channel 512

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]      
  - [[-1, 4], 1, Concat, [1]]                       # Concatenated with the P3 layer (index 4) of the backbone
  - [-1, 3, C2f_Faster, [256]]                           # (P3/8-small)
  - [-1, 1, CBAM, [256]]

  - [-1, 1, Conv, [256, 3, 2]]                      
  - [[-1, 14], 1, Concat, [1]]                      # Concatenate with the output of the first C2f in the "neck" (index 14)
  - [-1, 3, C2f, [512]]                             # (P4/16-medium)


  - [-1, 1, Conv, [512, 3, 2]]                      
  - [[-1, 11], 1, Concat, [1]]                      # Concatenating with the P5 layer of the backbone (index 11)
  - [-1, 3, C2f, [1024]]                            # (P5/32-large)
 

head:
  - [[17, 21, 24], 1, Detect, [nc]]                 # Three sets of outputs: P3 (index 17), P4 (index 21), P5 (index 24)